# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

In [7]:
import pandas as pd
import sqlite3
connection = sqlite3.connect('data.sqlite')
cursor = connection.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [13]:
#Your code here
cursor.execute("""SELECT firstName, lastName, city, state FROM employees
                        JOIN offices
                        USING(officeCode)
                        ORDER BY firstName, lastName;
                       """)
df = pd.DataFrame(cursor.fetchall()) 
df.columns = [i[0] for i in cursor.description]
print('Number of results:', len(df))
df.head()

Number of results: 23

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [14]:
# Your code here
cursor.execute("""SELECT customerName, orderNumber, orderDate, status FROM customers
                        JOIN orders
                        USING(customerNumber);
                       """)
df = pd.DataFrame(cursor.fetchall()) 
df.columns = [i[0] for i in cursor.description]
print('Number of results:', len(df))
df.head()

Number of results: 326

         customerName orderNumber   orderDate   status
0   Atelier graphique       10123  2003-05-20  Shipped
1   Atelier graphique       10298  2004-09-27  Shipped
2   Atelier graphique       10345  2004-11-25  Shipped
3  Signal Gift Stores       10124  2003-05-21  Shipped
4  Signal Gift Stores       10278  2004-08-06  Shipped

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [3]:
# Your code here
cursor.execute("""SELECT * FROM orders
                        JOIN orders
                        USING(customerNumber);
                       """)
df = pd.DataFrame(cursor.fetchall()) 
df.columns = [i[0] for i in cursor.description]
print('Number of results:', len(df))
df.head()

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and allthe product information for each product in the order.

In [4]:
# Your code here

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!